MorgothCreator/mSdk/SDK/platform/stm32f7xx/interface/twi_interface.c
    /* Wait until RXNE flag is set */
    //if(I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET, Timeout, tickstart) != HAL_OK)
    //{
    //  return HAL_TIMEOUT;
    //}
    /* Set NBYTES to write and reload if hi2c->XferCount > MAX_NBYTE_SIZE */
    if(hi2c->XferCount > MAX_NBYTE_SIZE)
    {
    	hi2c->XferSize = MAX_NBYTE_SIZE;
    	I2C_TransferConfig(hi2c, TwiStruct->MasterSlaveAddr, hi2c->XferSize, I2C_RELOAD_MODE, I2C_NO_STARTSTOP);
    }
    else
    {
    	hi2c->XferSize = hi2c->XferCount;
    	I2C_TransferConfig(hi2c, TwiStruct->MasterSlaveAddr, hi2c->XferSize, I2C_AUTOEND_MODE, I2C_NO_STARTSTOP);
    }

	do
	{
		/* Wait until RXNE flag is set */
		if(I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET, Timeout, tickstart) != HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Read data from RXDR */
	    (*hi2c->pBuffPtr++) = hi2c->Instance->RXDR;
	    hi2c->XferSize--;
	    hi2c->XferCount--;

		if((hi2c->XferSize == 0) && (hi2c->XferCount != 0))
		{
			/* Wait until TCR flag is set */
			if(I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TCR, RESET, Timeout, tickstart) != HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			if(hi2c->XferCount > MAX_NBYTE_SIZE)
			{
				hi2c->XferSize = MAX_NBYTE_SIZE;
				I2C_TransferConfig(hi2c, TwiStruct->MasterSlaveAddr, hi2c->XferSize, I2C_RELOAD_MODE, I2C_NO_STARTSTOP);
			}
			else
			{
				hi2c->XferSize = hi2c->XferCount;
				I2C_TransferConfig(hi2c, TwiStruct->MasterSlaveAddr, hi2c->XferSize, I2C_AUTOEND_MODE, I2C_NO_STARTSTOP);
			}
		}
	}while(hi2c->XferCount > 0);
	/* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
	/* Wait until STOPF flag is reset */
	if(I2C_WaitOnSTOPFlagUntilTimeout(hi2c, Timeout, tickstart) != HAL_OK)
	{
		if(hi2c->ErrorCode == HAL_I2C_ERROR_AF)
		{
			return HAL_ERROR;
		}
		else
		{
			return HAL_TIMEOUT;
		}
	}

	/* Clear STOP Flag */
	__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_STOPF);

	/* Clear Configuration Register 2 */
	I2C_RESET_CR2(hi2c);

	hi2c->State = HAL_I2C_STATE_READY;
	hi2c->Mode  = HAL_I2C_MODE_NONE;

	/* Process Unlocked */
	__HAL_UNLOCK(hi2c);

	return HAL_OK;
}


bool _I2C_trx(struct Twi_s* param, unsigned char addr, unsigned char *buff_send, unsigned int bytes_send, unsigned char *buff_receive, unsigned int bytes_receive)
{
	if(!param)
		return false;
#if (USE_DRIVER_SEMAPHORE == true)
	while(twi_semaphore[param->TwiNr]);
	twi_semaphore[param->TwiNr] = true;
#endif
	/*//param->MasterSlaveAddr = addr;
	param->TxBuff = buff_send;
	param->RxBuff = buff_receive;
	 I2C_HandleTypeDef *hi2c = (I2C_HandleTypeDef *)param->udata;
	 unsigned short tmp = buff_send[0];
	 tmp |= buff_send[1] << 8;
	bool result = HAL_I2C_Mem_Read(hi2c, addr, tmp, bytes_send, buff_receive, bytes_receive, 10);*/
	param->MasterSlaveAddr = addr;
	param->TxBuff = buff_send;
	param->RxBuff = buff_receive;
	bool result = TWI_MasterWriteRead(param, bytes_send, bytes_receive);

#if (USE_DRIVER_SEMAPHORE == true)
	twi_semaphore[param->TwiNr] = false;
#endif
	if(result == HAL_OK)
		return true;
	else
		return false;
}
/*#####################################################*/
bool _I2C_tx(struct Twi_s* param, unsigned char addr, unsigned char *buff_send, unsigned int bytes_send)
{
	if(!param)
		return false;
#if (USE_DRIVER_SEMAPHORE == true)
	while(twi_semaphore[param->TwiNr]);
	twi_semaphore[param->TwiNr] = true;
#endif
	/*//param->MasterSlaveAddr = addr;
	param->TxBuff = buff_send;
	 I2C_HandleTypeDef *hi2c = (I2C_HandleTypeDef *)param->udata;
	bool result = HAL_I2C_Mem_Write(hi2c, addr, *buff_send, 1, buff_send + 1, bytes_send - 1, 10);*/
	param->MasterSlaveAddr = addr;
	param->TxBuff = buff_send;
	bool result = TWI_MasterWriteRead(param, bytes_send, 0);
#if (USE_DRIVER_SEMAPHORE == true)
	twi_semaphore[param->TwiNr] = false;
#endif
	if(result == HAL_OK)
		return true;
	else
		return false;
}

/*#####################################################*/
bool _twi_open(new_twi* TwiStruct)
{
	if(TwiStruct->RxBuffSize) {
		TwiStruct->RxBuff = calloc(1, TwiStruct->RxBuffSize);
		if(!TwiStruct->RxBuff) {
			_twi_close(TwiStruct);
			return false;
		}
	}
	if(TwiStruct->TxBuffSize) {
		TwiStruct->TxBuff = calloc(1, TwiStruct->TxBuffSize);
		if(!TwiStruct->TxBuff) {
			_twi_close(TwiStruct);
			return false;
		}
	}
	return TWI_open(TwiStruct);
}
/*#####################################################*/
void _twi_close(new_twi* TwiStruct)
{
	sEE_LowLevel_DeInit(TwiStruct);
	if(TwiStruct->udata) free(TwiStruct->udata);
	if(TwiStruct->RxBuff) free(TwiStruct->RxBuff);
	if(TwiStruct->TxBuff) free(TwiStruct->TxBuff);
}
/*#####################################################*/
